Desafio16-Dividir-en-Capas/test/Artillery/result_con_consoleLog.txt
Phase started: unnamed (index: 0, duration: 1s) 01:55:15(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 01:55:16(-0300)

--------------------------------------
Metrics for period to: 01:55:20(-0300) (width: 4.792s)
--------------------------------------

http.codes.200: ................................................................ 266
http.request_rate: ............................................................. 60/sec
http.requests: ................................................................. 286
http.response_time:
  min: ......................................................................... 132
  max: ......................................................................... 414
  median: ...................................................................... 290.1
  p95: ......................................................................... 399.5
  p99: ......................................................................... 407.5
http.responses: ................................................................ 266
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20


--------------------------------------
Metrics for period to: 01:55:30(-0300) (width: 9.448s)
--------------------------------------

http.codes.200: ................................................................ 734
http.request_rate: ............................................................. 76/sec
http.requests: ................................................................. 714
http.response_time:
  min: ......................................................................... 15
  max: ......................................................................... 402
  median: ...................................................................... 237.5
  p95: ......................................................................... 354.3
  p99: ......................................................................... 368.8
http.responses: ................................................................ 734
vusers.completed: .............................................................. 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 13419.4
  max: ......................................................................... 13957.4
  median: ...................................................................... 13770.3
  p95: ......................................................................... 14048.5
  p99: ......................................................................... 14048.5


All VUs finished. Total time: 17 seconds

--------------------------------
Summary report @ 01:55:32(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 68/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 15
  max: ......................................................................... 414
  median: ...................................................................... 247.2
  p95: ......................................................................... 368.8
  p99: ......................................................................... 399.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 20
vusers.created: ................................................................ 20
vusers.created_by_name.0: ...................................................... 20
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 13419.4
  max: ......................................................................... 13957.4
  median: ...................................................................... 13770.3
  p95: ......................................................................... 14048.5
  p99: ......................................................................... 14048.5